config.org
#+TITLE: Emacs Config
#+AUTHOR: Adwait Adhikari
#+PROPERTY: header-args :tangle init.el
#+STARTUP: showeverything
#+OPTIONS: toc:2 ^:{}
#+auto_tangle: t

* Table of Contents :TOC:
- [[#important-initializations][Important Initializations]]
  - [[#early-init][Early Init]]
  - [[#loading-scripts--custom-file][Loading Scripts & Custom File]]
  - [[#evil-mode][Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
  - [[#icons][Icons]]
  - [[#modeline][Modeline]]
  - [[#sane-defaults][Sane Defaults]]
  - [[#session-preservation][Session Preservation]]
  - [[#theme][Theme]]
  - [[#which-key][Which Key]]
- [[#applications][Applications]]
  - [[#avy][Avy]]
  - [[#browse-url][Browse URL]]
  - [[#buffer-alist][Buffer Alist]]
  - [[#buffer-commands][Buffer Commands]]
  - [[#gptel][Gptel]]
  - [[#expand-region][Expand Region]]
  - [[#elfeed][Elfeed]]
  - [[#eww][Eww]]
  - [[#mu4e][Mu4e]]
  - [[#pdf-tools][PDF Tools]]
  - [[#uniline][Uniline]]
- [[#buffer-management][Buffer Management]]
  - [[#ibuffer][Ibuffer]]
  - [[#perspective][Perspective]]
- [[#development][Development]]
  - [[#completions][Completions]]
  - [[#formatters][Formatters]]
  - [[#flymake][Flymake]]
  - [[#language-servers][Language Servers]]
  - [[#language-configs][Language Configs]]
  - [[#ligatures][Ligatures]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#projectile][Projectile]]
  - [[#sops][SOPS]]
  - [[#treesitter][Treesitter]]
- [[#dired][Dired]]
  - [[#diredfl][Diredfl]]
  - [[#dired-open][Dired Open]]
  - [[#dired-rainbow][Dired Rainbow]]
  - [[#peep-dired][Peep Dired]]
- [[#fonts][Fonts]]
  - [[#setting-font-faces][Setting Font Faces]]
  - [[#zooming-inout][Zooming In/Out]]
- [[#git][Git]]
  - [[#diff-hl][Diff HL]]
  - [[#magit][Magit]]
- [[#helpful][Helpful]]
- [[#minibuffer-completion][Minibuffer Completion]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
  - [[#extended-settings][Extended Settings]]
  - [[#icons-1][Icons]]
  - [[#marginalia][Marginalia]]
  - [[#oderless][Oderless]]
  - [[#vertico][Vertico]]
- [[#org-mode][Org Mode]]
  - [[#better-fonts][Better Fonts]]
  - [[#org-roam][Org Roam]]
  - [[#prettify-symbols][Prettify Symbols]]
  - [[#settings][Settings]]
  - [[#small-utilities][Small Utilities]]
  - [[#svg-tags][SVG Tags]]
  - [[#visual-fill-column][Visual Fill Column]]
- [[#shells--terminals][Shells & Terminals]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
- [[#undo][Undo]]
  - [[#undo-fu][Undo Fu]]
  - [[#vundo][Vundo]]

* Important Initializations
** Early Init
Emacs is an Elisp interpreter, and when running programs or packages, it can occasionally experience pauses due to garbage collection. By increasing the garbage collection threshold, we reduce these pauses during heavy operations, leading to smoother performance. The default is 800 kilobytes. Measured in bytes.

~most-positive-fixnum~ is *DANGEROUS AS A PERMANENT VALUE*. See the ~elpaca-after-init-hook~ for what I actually use.
#+begin_src emacs-lisp :tangle early-init.el
  ;;; early-init.el --- Early Init -*- no-byte-compile: t; lexical-binding: t; -*-

  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.5)

  (add-hook 'elpaca-after-init-hook
            (lambda ()
              (setq gc-cons-threshold (* 50 1024 1024 1024)
                    gc-cons-percentage 0.1)))
#+end_src

Performance optimizations and other tweaks taken from [[https://github.com/jamescherti/minimal-emacs.d/blob/main/early-init.el][minimal-emacs.d]]
#+begin_src emacs-lisp :tangle early-init.el
  ;;; Misc

  (set-language-environment "UTF-8")

  ;; Set-language-environment sets default-input-method, which is unwanted.
  (setq default-input-method nil)

  ;;; Performance

  ;; Prefer loading newer compiled files
  (setq load-prefer-newer t)

  ;; Font compacting can be very resource-intensive, especially when rendering
  ;; icon fonts on Windows. This will increase memory usage.
  (setq inhibit-compacting-font-caches t)

  (unless (daemonp)
    (let ((old-value (default-toplevel-value 'file-name-handler-alist)))
      (set-default-toplevel-value
       'file-name-handler-alist
       ;; Determine the state of bundled libraries using calc-loaddefs.el.
       ;; If compressed, retain the gzip handler in `file-name-handler-alist`.
       ;; If compiled or neither, omit the gzip handler during startup for
       ;; improved startup and package load time.
       (if (eval-when-compile
             (locate-file-internal "calc-loaddefs.el" load-path))
           nil
         (list (rassq 'jka-compr-handler old-value))))
      ;; Ensure the new value persists through any current let-binding.
      (set-default-toplevel-value 'file-name-handler-alist
                                  file-name-handler-alist)
      ;; Remember the old value to reset it as needed.
      (add-hook 'emacs-startup-hook
                (lambda ()
                  (set-default-toplevel-value
                   'file-name-handler-alist
                   ;; Merge instead of overwrite to preserve any changes made
                   ;; since startup.
                   (delete-dups (append file-name-handler-alist old-value))))
                101))

    (unless noninteractive
          ;; Suppress redisplay and redraw during startup to avoid delays and
          ;; prevent flashing an unstyled Emacs frame.
          ;; (setq-default inhibit-redisplay t) ; Can cause artifacts
          (setq-default inhibit-message t)

          ;; Reset the above variables to prevent Emacs from appearing frozen or
          ;; visually corrupted after startup or if a startup error occurs.
          (defun minimal-emacs--reset-inhibited-vars-h ()
            ;; (setq-default inhibit-redisplay nil) ; Can cause artifacts
            (setq-default inhibit-message nil)
            (remove-hook 'post-command-hook #'minimal-emacs--reset-inhibited-vars-h))

          (add-hook 'post-command-hook
                    #'minimal-emacs--reset-inhibited-vars-h -100))

        (dolist (buf (buffer-list))
          (with-current-buffer buf
            (setq mode-line-format nil)))

        (put 'mode-line-format 'initial-value
             (default-toplevel-value 'mode-line-format))
        (setq-default mode-line-format nil)

        (defun minimal-emacs--startup-load-user-init-file (fn &rest args)
          "Advice for startup--load-user-init-file to reset mode-line-format."
          (unwind-protect
              (progn
                ;; Start up as normal
                (apply fn args))
            ;; If we don't undo inhibit-{message, redisplay} and there's an
            ;; error, we'll see nothing but a blank Emacs frame.
            (setq-default inhibit-message nil)
            (unless (default-toplevel-value 'mode-line-format)
              (setq-default mode-line-format
                            (get 'mode-line-format 'initial-value)))))

        (advice-add 'startup--load-user-init-file :around
                    #'minimal-emacs--startup-load-user-init-file))

      ;; Without this, Emacs will try to resize itself to a specific column size
      (setq frame-inhibit-implied-resize t)

      ;; A second, case-insensitive pass over `auto-mode-alist' is time wasted.
      ;; No second pass of case-insensitive search over auto-mode-alist.
      (setq auto-mode-case-fold nil)

      ;; Reduce *Message* noise at startup. An empty scratch buffer (or the
      ;; dashboard) is more than enough, and faster to display.
      (setq inhibit-startup-screen t
            inhibit-startup-echo-area-message user-login-name)
      (setq initial-buffer-choice nil
            inhibit-startup-buffer-menu t
            inhibit-x-resources t)

      ;; Disable bidirectional text scanning for a modest performance boost.
      (setq-default bidi-display-reordering 'left-to-right
                    bidi-paragraph-direction 'left-to-right)

      ;; Give up some bidirectional functionality for slightly faster re-display.
      (setq bidi-inhibit-bpa t)

      ;; Remove "For information about GNU Emacs..." message at startup
      (advice-add #'display-startup-echo-area-message :override #'ignore)

      ;; Suppress the vanilla startup screen completely. We've disabled it with
      ;; `inhibit-startup-screen', but it would still initialize anyway.
      (advice-add #'display-startup-screen :override #'ignore)

      ;; Shave seconds off startup time by starting the scratch buffer in
      ;; `fundamental-mode'
      (setq initial-major-mode 'fundamental-mode
            initial-scratch-message nil)

      ;; Unset command line options irrelevant to the current OS. These options
      ;; are still processed by `command-line-1` but have no effect.
      (unless (eq system-type 'darwin)
        (setq command-line-ns-option-alist nil))
      (unless (memq initial-window-system '(x pgtk))
        (setq command-line-x-option-alist nil))

  ;;; Native compilation and Byte compilation

  (if (and (featurep 'native-compile)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
      ;; Activate `native-compile'
      (setq native-comp-jit-compilation t
            package-native-compile t)
    ;; Deactivate the `native-compile' feature if it is not available
    (setq features (delq 'native-compile features)))

  ;; Disable startup screens and messages
  (setq inhibit-splash-screen t)

  ;; I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;; `scroll-bar-mode' because manipulating frame parameters can trigger or queue
  ;; a superfluous and potentially expensive frame redraw at startup, depending
  ;; on the window system. The variables must also be set to `nil' so users don't
  ;; have to call the functions twice to re-enable them.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (unless (memq window-system '(mac ns))
    (setq menu-bar-mode nil))

  (unless (daemonp)
    (unless noninteractive
      (when (fboundp 'tool-bar-setup)
        ;; Temporarily override the tool-bar-setup function to prevent it from
        ;; running during the initial stages of startup
        (advice-add #'tool-bar-setup :override #'ignore)
        (define-advice startup--load-user-init-file
            (:after (&rest _) minimal-emacs-setup-toolbar)
          (advice-remove #'tool-bar-setup #'ignore)
          (when tool-bar-mode
            (tool-bar-setup))))))

  (push '(tool-bar-lines . 0) default-frame-alist)
  (setq tool-bar-mode nil)

  (push '(vertical-scroll-bars) default-frame-alist)
  (push '(horizontal-scroll-bars) default-frame-alist)
  (setq scroll-bar-mode nil)
  (when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

  (when (bound-and-true-p tooltip-mode)
    (tooltip-mode -1))

  ;; Disable GUIs because they are inconsistent across systems, desktop
  ;; environments, and themes, and they don't match the look of Emacs.
  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
#+end_src

The early init file contains disabling ~package.el~, Emacs' default package manager, as we are about to use [[https://github.com/progfolio/elpaca][elpaca]] for package management.
#+begin_src emacs-lisp :tangle early-init.el

  (setq package-enable-at-startup nil)

#+end_src

We are also setting a const variable to locate our custom emacs directories.
#+begin_src emacs-lisp
  ;;; init.el --- Init -*- no-byte-compile: t; lexical-binding: t; -*-

  (defconst nox/emacs-directory (concat (getenv "HOME") "/.config/aurora-emacs/" ))
  (defconst nox/notes-directory (concat (getenv "HOME") "/Documents/Zettels/"))

#+end_src

** Loading Scripts & Custom File
Displaying the time it took for emacs to start along with total number of garbage collections at startup. Throught this file we also replace ~emacs-startup-hook~ and ~after-init-hook~ with =elpaca-after-init-hook= since we are using [[https://github.com/progfolio/elpaca][elpaca]] for package management.
#+begin_src emacs-lisp
  ;;; init.el --- file for init -*- no-byte-compile: t; lexical-binding: t; -*-

  (defun nox/display-startup-time ()
    "Display the emacs startup time"
    (interactive)
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

#+end_src

We are also setting a const variable to locate our custom emacs directories.
#+begin_src emacs-lisp

  (defconst nox/emacs-directory (concat (getenv "HOME") "/.config/minimal-emacs/" ))
  (defconst nox/notes-directory (concat (getenv "HOME") "/Documents/Zettels/"))

#+end_src

Here we specify the ~scripts~ directory to contains other elisp files that we are about to load. We also specify a custom ~custom-file~ so that emacs doesn't messup out ~init.el~.
#+begin_src emacs-lisp

  (add-to-list 'load-path (concat nox/emacs-directory "scripts/"))

  ;; setting the core date by searching from hydra for nixos
  (setq elpaca-core-date '(20241224))
  (require 'elpaca-setup)   ;; Elpaca Package Manager
  (require 'on)             ;; Doom Style Hooks
  (require 'minimal)        ;; emacs config from minimal-emacs.d
  (require 'link-converter) ;; md <=> converter

  ;; Specify the custom file path
  (setq custom-file (concat nox/emacs-directory "custom-vars.el"))

  ;; Load the custom file quietly
  (add-hook 'elpaca-after-init-hook
            (lambda () (load custom-file 'noerror 'nomessage)))

#+end_src

