init.el
;;; init.el --- Init -*- no-byte-compile: t; lexical-binding: t; -*-

(defconst nox/emacs-directory (concat (getenv "HOME") "/.config/aurora-emacs/" ))
(defconst nox/notes-directory (concat (getenv "HOME") "/Documents/Zettels/"))

;;; init.el --- file for init -*- no-byte-compile: t; lexical-binding: t; -*-

(defun nox/display-startup-time ()
  "Display the emacs startup time"
  (interactive)
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(defconst nox/emacs-directory (concat (getenv "HOME") "/.config/minimal-emacs/" ))
(defconst nox/notes-directory (concat (getenv "HOME") "/Documents/Zettels/"))

(add-to-list 'load-path (concat nox/emacs-directory "scripts/"))

;; setting the core date by searching from hydra for nixos
(setq elpaca-core-date '(20241224))
(require 'elpaca-setup)   ;; Elpaca Package Manager
(require 'on)             ;; Doom Style Hooks
(require 'minimal)        ;; emacs config from minimal-emacs.d
(require 'link-converter) ;; md <=> converter

;; Specify the custom file path
(setq custom-file (concat nox/emacs-directory "custom-vars.el"))

;; Load the custom file quietly
(add-hook 'elpaca-after-init-hook
          (lambda () (load custom-file 'noerror 'nomessage)))
