init.el

(use-package benchmark-init
  :ensure t
  :config
  (add-hook 'after-init-hook 'benchmark-init/deactivate))

(use-package evil
  :custom
  (evil-want-integration t)
  (evil-want-C-u-scroll t)
  (evil-want-keybinding nil)
  (evil-undo-system 'undo-fu)
  (evil-vsplit-window-right t)
  (evil-vsplit-window-below t)
  :config
  (evil-mode)

(evil-define-key 'motion 'global
  (kbd "C-w u") 'winner-undo
  "j" 'evil-next-visual-line
  "k" 'evil-previous-visual-line)

(evil-define-key 'normal 'global
  (kbd "C-S-v") 'cua-set-mark
  (kbd "C-o") 'casual-editkit-main-tmenu
  "s" 'evil-avy-goto-char-timer)

(evil-define-key '(normal visual) 'global
  "P" 'consult-yank-from-kill-ring
  "H" 'evil-first-non-blank
  "L" 'evil-end-of-line)

(evil-define-key 'normal org-mode-map
  "J" 'org-shiftright
  "K" 'org-shiftleft)

(evil-define-key 'normal elfeed-search-mode-map
  "l" 'elfeed-search-show-entry))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)
  :custom
  (evil-collection-want-find-usages-bindings t))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package general
  :config
  (general-evil-setup)
  (general-create-definer nox/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "C-SPC")

(nox/leader-keys
  "a" '(:ignore t :wk "[A]pplications")
  "a e" '(elfeed :wk "[E]lfeed")
  "a g" '(gptel :wk "[G]ptel")
  "a m" '(mu4e :wk "[M]ail"))

(nox/leader-keys
  "b" '(:ignore t :wk "[B]uffer")
  "b b" '(consult-buffer :wk "[B]uffer Switch")
  "b i" '(persp-ibuffer :wk "[I]buffer")
  "b k" '(kill-current-buffer :wk "[K]ill Buffer")
  "b n" '(next-buffer :wk "[N]ext Buffer")
  "b p" '(previous-buffer :wk "[P]revious Buffer")
  "b s" '(hydra-buffer-switch/body :wk "[S]witch Buffer")
  "b r" '(revert-buffer :wk "[R]eload Buffer"))

(nox/leader-keys
  "d" '(:ignore t :wk "[D]ired")
  "d ." '(dired-omit-mode :wk "Toggle dot files")
  "d d" '(dired-jump :wk "[D]ired")
  "d h" '(dired-hide-details-mode :wk "[D]ired")
  "d p" '(peep-dired :wk "[P]eep Dired"))

(nox/leader-keys
  "e" '(:ignore t :wk "[E]val")
  "e b" '(eval-buffer :wk "[B]uffer Eval")
  "e d" '(eval-defun :wk "[D]efun Eval")
  "e e" '(eval-expression :wk "[E]xpression Eval")
  "e l" '(eval-last-sexp :wk "[E]xpression Before Eval")
  "e r" '(eval-region :wk "[R]egion Eval"))

(nox/leader-keys
  "f" '(:ignore t :wk "[F]ile")
  "f c" `((lambda () (interactive) (find-file ,(concat nox/emacs-directory "config.org")))
          :wk "Edit emacs config")
  "f s" '(save-buffer :wk "[S]ave Buffer")
  "f u" '(sudo-edit-find-file :wk "S[U]do Find File")
  "f U" '(sudo-edit :wk "S[U]do Edit File"))

(nox/leader-keys
  "g" '(:ignore t :wk "[G]it")
  "g g" '(magit-status :wk "[G]it Status")
  "g s" '(diff-hl-stage-dwim :wk "[G]it Stage Hunk"))

(nox/leader-keys
  "o" '(:ignore t :wk "[O]rg")
  "o a" '(org-agenda :wk "[A]genda")
  "o e" '(org-edit-src-code :wk "[E]dit Src Code")
  "o x" '(org-toggle-checkbox :wk "[C]heckbox")
  "o l" '(org-store-link :wk "[L]ink Store")
  "o b" '(:ignore t :wk "[B]abel")
  "o b t" '(org-babel-tangle :wk "[T]angle")
  "o b d" '(org-babel-demarcate-block :wk "[D]emarcate Block"))

(nox/leader-keys
  "o p" '(:ignore t :wk "[P]roperties")
  "o p s" '(org-schedule :wk "[S]chedule")
  "o p d" '(org-deadline :wk "[D]eadline")
  "o p e" '(org-set-effort :wk "[E]ffort")
  "o p t" '(nox/org-toggle-properties :wk "[T]oggle Properties")
  "o p p" '(org-set-effort :wk "[P]roperty"))

(nox/leader-keys
  "o i" '(org-roam-node-insert :wk "[I]nsert Link")
  "o c" '((lambda () (interactive) (org-roam-capture nil "d")) :wk "[C]apture")
  "o C" '(org-roam-capture :wk "[C]apture with Templates")
  "o f" '(org-roam-node-find :wk "[F]ind Node")
  "o t" '(nox/org-roam-capture-tasks :wk "[T]ask Capture")
  "o d" '((lambda () (interactive) (org-roam-dailies-capture-today nil "d")) :wk "[D]aily Capture")
  "o D" '(org-roam-dailies-capture-today :wk "[D]aily Open"))

(nox/leader-keys
  "q" '(:ignore t :wk "[Q]uit")
  "q f" '(delete-frame :wk "[F]rame delete")
  "q r" '(nox/restore-perspectives :wk "[R]estore perspectives")
  "q K" '(kill-emacs :wk "[K]ill emacs"))

(nox/leader-keys
  "s" '(:ignore t :wk "[S]earch")
  "s g" '(consult-ripgrep :wk "[G]rep in dir")
  "s i" '(consult-imenu :wk "[I]menu")
  "s f" '(consult-fd :wk "[F]d Consult")
  "s r" '(consult-recent-file :wk "[R]recent File")
  "s m" '(bookmark-jump :wk "[M]arks")
  "s c" '(consult-mode-command :wk "[C]ommands for mode"))

(nox/leader-keys
  "t" '(:ignore t :wk "[T]oggle")
  "t e" '(eshell-toggle :wk "[E]shell")
  "t l" '(elpaca-log :wk "[L]og Elpaca")
  "t t" '(modus-themes-toggle :wk "[T]oggle Theme")
  "t c" '(visual-fill-column-mode :wk "[C]olumn Fill Mode")
  "t v" '(vterm-toggle :wk "[V]term")
  "t n" '(display-line-numbers-mode :wk "[N]umbered Lines")
  "t s" '(hydra-text-scale/body :wk "[S]cale Text"))

(nox/leader-keys
  "." '(find-file :wk "Find File")
))

(use-package all-the-icons)
(use-package nerd-icons :defer 2)

(use-package doom-modeline
  :hook
  (on-init-ui . doom-modeline-mode)
  :config
  (setq find-file-visit-truename t)
  (setq doom-modeline-icon t)
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-percent-position nil)
  (setq doom-modeline-height 36))

(use-package hide-mode-line :commands hide-mode-line-mode)

(use-package emacs
  :ensure nil
  :hook
