init.el
  (prog-mode . display-line-numbers-mode)
  :init
  (electric-indent-mode -1)    ;; Disable weird emacs indenting
  (indent-tabs-mode -1)        ;; Disable the use of tabs for indentation
  (line-number-mode -1)        ;; Disable line number from showing in modline
  (xterm-mouse-mode 1)         ;; Enable mouse support in terminal mode.
  (file-name-shadow-mode 1)    ;; Enable shadowing of filenames for clarity.
  (electric-pair-mode 1)       ;; Enable pair parens
  (display-battery-mode 1)     ;; Enable displaying battery info in modline
  (winner-mode 1)              ;; Easily undo window configuration changes.
  :custom
  (delete-selection-mode 1)             ;; Replacing selected text with typed text.
  (global-visual-line-mode 1)           ;; Better text wrapping
  (display-line-numbers-type 'relative) ;; Use relative line numbering
  (history-length 25)                   ;; Set the length of the command history.
  (ispell-dictionary "en_US")           ;; Default dictionary for spell checking.
  (pixel-scroll-precision-mode t)       ;; Enable precise pixel scrolling.
  (ring-bell-function 'ignore)          ;; Disable the audible bell.
  (tab-width 4)                         ;; Set the tab width to 4 spaces.
  (use-dialog-box nil)                  ;; Disable dialog boxes
  (warning-minimum-level :error)        ;; Set the minimum level of warnings.
  (show-paren-context-when-offscreen t) ;; Show context of parens when offscreen
  (pixel-scroll-precision-use-momentum nil) ;; Disable momentum scrolling

  ;; Don't jump the cursor around when scrolling
  (scroll-conservatively 101)
  ;; TAB key complete, instead of just indenting.
  (tab-always-indent 'complete)
  ;; Use advanced font locking for Treesit mode.
  (treesit-font-lock-level 4)
  ;; Offer to delete any autosave file when killing a buffer.
  (kill-buffer-delete-auto-save-files t)
  ;; Prevent automatic window splitting if the window width exceeds 300 pixels.
  (split-width-threshold 300)
  :config
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  (setq-default indent-tabs-mode nil))

(use-package woman
  :ensure nil
  :hook
  (woman-mode . visual-fill-column-mode)
  :custom
  (woman-fill-frame t))

(setq auto-save-default t     ; auto-save every buffer that visits a file
      auto-save-timeout 20    ; number of seconds idle time before auto-save
      auto-save-interval 200  ; number of keystrokes between auto-saves

      ;; Do not auto-disable auto-save after deleting large chunks of text
      auto-save-include-big-deletions t)

(setq auto-save-list-file-prefix
      (expand-file-name "autosave/" user-emacs-directory))
(setq tramp-auto-save-directory
      (expand-file-name "tramp-autosave/" user-emacs-directory))

(global-auto-revert-mode 1)  ;; Keep buffers up to date with their files.
(setq global-auto-revert-non-file-buffers t)   ;; Automatically refresh non-file buffers.
(setq revert-without-query (list ".")  ; Do not prompt
      auto-revert-stop-on-user-input nil
      auto-revert-verbose t)

;; setting the backup dir to trash.

(setq backup-directory-alist '(("." .
                                  (concat (getenv "XDG_DATA_HOME") "/Trash/files")))
        make-backup-files t     ; backup of a file the first time it is saved.
        backup-by-copying t     ; don't clobber symlinks
        version-control t       ; version numbers for backup files
        delete-old-versions t   ; delete excess backup files silently
        kept-old-versions 6     ; oldest versions to keep when a new numbered
        kept-new-versions 9)    ; newest versions to keep when a new numbered

(save-place-mode 1)
(setq save-place-file (expand-file-name "saveplace" user-emacs-directory))
(setq save-place-limit 600)

(setq savehist-additional-variables
      '(kill-ring
        command-history
        set-variable-value-history
        custom-variable-history
        query-replace-history
        read-expression-history
        minibuffer-history
        read-char-history
        face-name-history
        bookmark-history
        file-name-history))

(setq history-length 300)
(setq kill-ring-max 25)
(put 'minibuffer-history         'history-length 50)
(put 'file-name-history          'history-length 50)
(put 'set-variable-value-history 'history-length 25)
(put 'custom-variable-history    'history-length 25)
(put 'query-replace-history      'history-length 25)
(put 'read-expression-history    'history-length 25)
(put 'read-char-history          'history-length 25)
(put 'face-name-history          'history-length 25)
(put 'bookmark-history           'history-length 25)
(savehist-mode 1)

(defun unpropertize-kill-ring ()
  (setq kill-ring (mapcar 'substring-no-properties kill-ring)))
(add-hook 'kill-emacs-hook 'unpropertize-kill-ring)

(setq recentf-max-menu-items 25)
(recentf-mode 1)
(setq recentf-max-saved-items 300) ; default is 20
(setq recentf-auto-cleanup 'mode)

(use-package modus-themes
  :config
  (setq modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-mixed-fonts t

        ;; Options for `modus-themes-prompts' are either nil (the
        ;; default), or a list of properties that may include any of those
        ;; symbols: `italic', `WEIGHT'
        modus-themes-prompts '(italic bold)

        ;; The `modus-themes-completions' is an alist that reads two
        ;; keys: `matches', `selection'.  Each accepts a nil value (or
        ;; empty list) or a list of properties that can include any of
        ;; the following (for WEIGHT read further below):
        ;;
        ;; `matches'   :: `underline', `italic', `WEIGHT'
        ;; `selection' :: `underline', `italic', `WEIGHT'
        modus-themes-completions
        '((matches . (extrabold))
          (selection . (semibold italic text-also)))

        ;; Remove the border
        ;; Make the fringe invisible
        modus-themes-common-palette-overrides
        '((border-mode-line-active unspecified)
          (border-mode-line-inactive unspecified)
          (fringe unspecified))

        modus-themes-to-toggle
        '(modus-operandi-tinted modus-vivendi-tinted)

        modus-themes-headings
        '((1 . (variable-pitch 1.5))
          (2 . (1.3))
          (3 . (1.1))
          (agenda-date . (1.3))
          (agenda-structure . (variable-pitch light 1.8))
          (t . (1.1))))

  (load-theme 'modus-vivendi-tinted t))

;; adding padding to ui elements to make doing tasks feel more comfortable
(use-package spacious-padding
  :after modus-themes
  :config
  (spacious-padding-mode))
