config.org
** Which Key
[[https://github.com/justbur/emacs-which-key][Whichkey]] helps showcase the available bindings. Not much to talk about it, it is a nice to have to discover new bindings or to quickly see what the bindings do. Whichkey comes built in to emacs starting =v30=.
#+begin_src emacs-lisp

  (use-package which-key
    :config (which-key-mode)
    :ensure nil
    :custom
    (which-key-side-window-location 'bottom)
    (which-key-sort-order #'which-key-key-order-alpha)
    (which-key-sort-uppercase-first nil)
    (which-key-add-column-padding 1)
    (which-key-max-display-columns nil)
    (which-key-min-display-lines 10)
    (which-key-side-window-slot -10)
    (which-key-side-window-max-height 0.25)
    (which-key-idle-delay 0.3)
    (which-key-max-description-length 25)
    (which-key-allow-imprecise-window-fit nil)
    (which-key-separator " → " ))

#+end_src

* Applications
** Avy
Jumping around in text has never been easier! Use the =s= key in normal mode to see what [[https://github.com/abo-abo/avy][avy]] is capable of. Here we also change the default text face when avy is activated to make it easier to see the jump places. I copied the =avy-jump-org-block= from [[https://www.howardabrams.com/hamacs/ha-org-literate.html][howard abrams]].
#+begin_src emacs-lisp

  (use-package avy
    :commands evil-avy-goto-char-timer
    :custom
    (avy-background t)
    (avy-timeout-seconds 0.5)
    :config
    (defun nox/avy-jump-org-block ()
      "Jump to org block using Avy subsystem."
      (interactive)
      (avy-jump (rx line-start (zero-or-more blank) "#+begin_src")
                :action 'goto-char)
      ;; Jump _into_ the block:
      (forward-line))
    (defun nox/avy-jump-to-link ()
      "Jump to org block using Avy subsystem."
      (interactive)
      (avy-jump (rx (or "http://" "https://")) :action 'goto-char))
    (set-face-attribute 'avy-background-face nil
                        :background 'unspecified))

#+end_src

** Browse URL
Here we customize the default behavior of when emacs tries to open a web url. As a sort of general case, here we have defined functions so that whenever you try to open a web url, a new prompt is displayed asking whether to open a private firefox tab for that url.
#+begin_src emacs-lisp

  (defun nox/browse-url-maybe-privately (url &optional new-window)
    "Ask whether URL should be browsed in a private browsing window."
    (interactive "URL: ")
    (if (y-or-n-p "Private Browsing? ")
        (nox/browse-url-firefox-privately url)
      (browse-url-default-browser url new-window)))

  (defun nox/browse-url-firefox-privately (url &optional new-window)
    "Make firefox open URL in private-browsing window."
    (interactive (browse-url-interactive-arg "URL: "))
    (let ((process-environment (browse-url-process-environment)))
      (apply 'start-process
             (concat "firefox " url)
             nil
             browse-url-firefox-program
             (list "-private-window" url))))

  (defun nox/open-in-reddigg (url &optional new-window)
    "Open the provided url in reddigg"
    (reddigg-view-comments url))

  (defun nox/parse-readwise (url &optional new-window)
    "Extract, decode and open the save URL part from a given Readwise URL."
    (if (string-match "https://wise\\.readwise\\.io/save\\?url=\\(.*\\)" url)
        (nox/browse-url-maybe-privately (url-unhex-string (match-string 1 url)))
      (error "Invalid URL format")))

#+end_src

Now we setup rules for when to use the above defined functions. Here we have reddit for example where ~nox/open-in-reddigg~ is called whenever you try to open a url matching the below described pattern for reddit.
#+begin_src emacs-lisp

  (setq browse-url-handlers
        '(("^https?://www\\.reddit\\.com" . nox/open-in-reddigg)
          ("^https?://arstechnica\\.com" . eww)
          ("^https?://wise\\.readwise\\.io/save\\?url=" . nox/parse-readwise)
          ("." . nox/browse-url-maybe-privately)))

  (setq browse-url-generic-program "firefox")

#+end_src

** Buffer Alist
#+begin_src emacs-lisp

  (setq display-buffer-alist
        '(("\\*Occur\\*"
           (display-buffer-reuse-mode-window)
           (display-buffer-below-selected)
           (dedicated . t)
           (window-height . fit-window-to-buffer))
          ))

#+end_src

** Buffer Commands
Run commands for specific buffer. The name of the buffer is enough to make the following work.
#+begin_src emacs-lisp

  (defun nox/run-commands-for-buffer-names ()
    "Run specific commands for certain buffer names."
    (let ((buffer-name (buffer-name)))
      (cond
       ((string-prefix-p "*ChatGPT" buffer-name)
        ;; make the window dedicated
        (set-window-dedicated-p (selected-window) t))

       ((string= buffer-name "*use-package statistics*")
        (hl-line-mode))

       ((string= buffer-name "*reddigg-comments*")
        (org-appear-mode -1)
        (evil-goto-first-line)
        ;; convert all md links to org links
        (nox/md-to-org-links)
        ;; make the window dedicated
        (set-window-dedicated-p (selected-window) t)
        ;; easier quitting of the window
        (evil-local-set-key 'normal "q" 'kill-current-buffer)
        ;; open all folds
        (org-fold-show-all)
        (read-only-mode))
       )))

  ;; Add the function to hooks
  (add-hook 'buffer-list-update-hook 'nox/run-commands-for-buffer-names)

#+end_src

** Gptel
The =gptel= package for Emacs is a client for OpenAI's GPT models, enabling users to interact with the AI directly within the Emacs environment. It provides a convenient interface for sending prompts and receiving responses, allowing for streamlined integration of AI-assisted writing and code generation. With features like customizable prompts, conversation history, and support for multiple models, =gptel= enhances the productivity of Emacs users by leveraging powerful AI capabilities right in their workflow.
#+begin_src emacs-lisp

  (use-package gptel
    :commands gptel
    :hook
    (gptel-mode . evil-insert-state)
    (gptel-post-stream . gptel-auto-scroll)
    (gptel-post-response-functions . gptel-end-of-response)
    :bind* (("C-c RET" . gptel-send))
    :custom
    (gptel-default-mode 'org-mode)
    (gptel-api-key
     (nth 0 (process-lines "cat"
                           (concat
                            (getenv "HOME")
                            "/.config/sops-nix/secrets/api_keys/openai"))))
    :config
    (gptel-make-kagi "Kagi"
      :key
      (nth 0 (process-lines "cat"
                            (concat
                             (getenv "HOME")
                             "/.config/sops-nix/secrets/api_keys/kagi"))))
    (gptel-make-gemini "Gemini"
      :key
      (nth 0 (process-lines "cat"
                            (concat
                             (getenv "HOME")
                             "/.config/sops-nix/secrets/api_keys/gemini")))
      :stream t))

#+end_src

** Expand Region
#+begin_src emacs-lisp

  (use-package expand-region
    :bind ("C-=" . er/expand-region))

#+end_src

** Elfeed
[[https://github.com/skeeto/elfeed][Elfeed]] is a rss reader for emacs. Here, since elfeed doesn't have a hook for when displaying a feed item, we customize ~elfeed-show-entry-switch~ to make it work like a hook for this particular usecase.
#+begin_src emacs-lisp

  (use-package elfeed
    :commands elfeed
    :custom
    (elfeed-search-filter "@1-weeks-ago +unread")
    :config
    (require 'nano-elfeed)
    (evil-define-key 'normal elfeed-search-mode-map
      (kbd "j") 'nano-elfeed-next-entry
      (kbd "k") 'nano-elfeed-prev-entry)
    (defun nox/elfeed-show (buff)
      (switch-to-buffer buff)
      (display-line-numbers-mode -1)
      (visual-fill-column-mode)
      (elfeed-show-refresh))
    (setq elfeed-show-entry-switch 'nox/elfeed-show))

#+end_src

Here we also setup [[https://github.com/remyhonig/elfeed-org][elfeed org]] to making managing our feed urls that much more easier. Since this uses org file for setting up the feeds, it is a lot more powerful than the default way.
#+begin_src emacs-lisp

  (use-package elfeed-org
    :after elfeed
    :custom
    (rmh-elfeed-org-files `(,(concat nox/emacs-directory "elfeed.org")))
    :config (elfeed-org))

#+end_src

*** Elfeed Tube
[[https://github.com/karthink/elfeed-tube][Elfeed Tube]] improves the already outstanding [[#elfeed][elfeed]] to work even more seamlessly with youtube. It adds thumbnail, transcript, mpv support and so much more to youtube feeds.
#+begin_src emacs-lisp

    (use-package elfeed-tube
      :after elfeed
      :custom
      (elfeed-tube-auto-save-p t)
      (elfeed-tube-fields '(duration thumbnail captions chapters))
      :config
      (elfeed-tube-setup)
      :general
      (:keymaps 'elfeed-show-mode-map :states 'normal
                "F" 'elfeed-tube-mpv-follow-mode
                "M" 'elfeed-tube-mpv
                "M-RET" (lambda () (interactive) (nox/avy-jump-to-link) (browse-url-generic))
                [remap save-buffer] 'elfeed-tube-save)
      (:keymaps 'elfeed-search-mode-map :states 'normal
                "F" 'elfeed-tube-fetch
                [remap elfeed-search-fetch] 'elfeed-update
                [remap save-buffer] 'elfeed-tube-save))

    (use-package elfeed-tube-mpv :after efleed-tube)

#+end_src

*** Reddigg
[[https://github.com/thanhvg/emacs-reddigg][Reddigg]] is an interface for emacs to make viewing reddit inside emacs more well integrated. It uses org mode to display the reddit feed, but here we mostly use it for its ability to show reddit comments as foldedup org headings.
#+begin_src emacs-lisp

  (use-package reddigg :commands reddigg-view-comments)

#+end_src

