init.el

(use-package which-key
  :config (which-key-mode)
  :ensure nil
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-max-display-columns nil)
  (which-key-min-display-lines 10)
  (which-key-side-window-slot -10)
  (which-key-side-window-max-height 0.25)
  (which-key-idle-delay 0.3)
  (which-key-max-description-length 25)
  (which-key-allow-imprecise-window-fit nil)
  (which-key-separator " → " ))

(use-package avy
  :commands evil-avy-goto-char-timer
  :custom
  (avy-background t)
  (avy-timeout-seconds 0.5)
  :config
  (defun nox/avy-jump-org-block ()
    "Jump to org block using Avy subsystem."
    (interactive)
    (avy-jump (rx line-start (zero-or-more blank) "#+begin_src")
              :action 'goto-char)
    ;; Jump _into_ the block:
    (forward-line))
  (defun nox/avy-jump-to-link ()
    "Jump to org block using Avy subsystem."
    (interactive)
    (avy-jump (rx (or "http://" "https://")) :action 'goto-char))
  (set-face-attribute 'avy-background-face nil
                      :background 'unspecified))

(defun nox/browse-url-maybe-privately (url &optional new-window)
  "Ask whether URL should be browsed in a private browsing window."
  (interactive "URL: ")
  (if (y-or-n-p "Private Browsing? ")
      (nox/browse-url-firefox-privately url)
    (browse-url-default-browser url new-window)))

(defun nox/browse-url-firefox-privately (url &optional new-window)
  "Make firefox open URL in private-browsing window."
  (interactive (browse-url-interactive-arg "URL: "))
  (let ((process-environment (browse-url-process-environment)))
    (apply 'start-process
           (concat "firefox " url)
           nil
           browse-url-firefox-program
           (list "-private-window" url))))

(defun nox/open-in-reddigg (url &optional new-window)
  "Open the provided url in reddigg"
  (reddigg-view-comments url))

(defun nox/parse-readwise (url &optional new-window)
  "Extract, decode and open the save URL part from a given Readwise URL."
  (if (string-match "https://wise\\.readwise\\.io/save\\?url=\\(.*\\)" url)
      (nox/browse-url-maybe-privately (url-unhex-string (match-string 1 url)))
    (error "Invalid URL format")))

(setq browse-url-handlers
      '(("^https?://www\\.reddit\\.com" . nox/open-in-reddigg)
        ("^https?://arstechnica\\.com" . eww)
        ("^https?://wise\\.readwise\\.io/save\\?url=" . nox/parse-readwise)
        ("." . nox/browse-url-maybe-privately)))

(setq browse-url-generic-program "firefox")

(setq display-buffer-alist
      '(("\\*Occur\\*"
         (display-buffer-reuse-mode-window)
         (display-buffer-below-selected)
         (dedicated . t)
         (window-height . fit-window-to-buffer))
        ))

(defun nox/run-commands-for-buffer-names ()
  "Run specific commands for certain buffer names."
  (let ((buffer-name (buffer-name)))
    (cond
     ((string-prefix-p "*ChatGPT" buffer-name)
      ;; make the window dedicated
      (set-window-dedicated-p (selected-window) t))

     ((string= buffer-name "*use-package statistics*")
      (hl-line-mode))

     ((string= buffer-name "*reddigg-comments*")
      (org-appear-mode -1)
      (evil-goto-first-line)
      ;; convert all md links to org links
      (nox/md-to-org-links)
      ;; make the window dedicated
      (set-window-dedicated-p (selected-window) t)
      ;; easier quitting of the window
      (evil-local-set-key 'normal "q" 'kill-current-buffer)
      ;; open all folds
      (org-fold-show-all)
      (read-only-mode))
     )))

;; Add the function to hooks
(add-hook 'buffer-list-update-hook 'nox/run-commands-for-buffer-names)

(use-package gptel
  :commands gptel
  :hook
  (gptel-mode . evil-insert-state)
  (gptel-post-stream . gptel-auto-scroll)
  (gptel-post-response-functions . gptel-end-of-response)
  :bind* (("C-c RET" . gptel-send))
  :custom
  (gptel-default-mode 'org-mode)
  (gptel-api-key
   (nth 0 (process-lines "cat"
                         (concat
                          (getenv "HOME")
                          "/.config/sops-nix/secrets/api_keys/openai"))))
  :config
  (gptel-make-kagi "Kagi"
    :key
    (nth 0 (process-lines "cat"
                          (concat
                           (getenv "HOME")
                           "/.config/sops-nix/secrets/api_keys/kagi"))))
  (gptel-make-gemini "Gemini"
    :key
    (nth 0 (process-lines "cat"
                          (concat
                           (getenv "HOME")
                           "/.config/sops-nix/secrets/api_keys/gemini")))
    :stream t))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package elfeed
  :commands elfeed
  :custom
  (elfeed-search-filter "@1-weeks-ago +unread")
  :config
  (require 'nano-elfeed)
  (evil-define-key 'normal elfeed-search-mode-map
    (kbd "j") 'nano-elfeed-next-entry
    (kbd "k") 'nano-elfeed-prev-entry)
  (defun nox/elfeed-show (buff)
    (switch-to-buffer buff)
    (display-line-numbers-mode -1)
    (visual-fill-column-mode)
    (elfeed-show-refresh))
  (setq elfeed-show-entry-switch 'nox/elfeed-show))

(use-package elfeed-org
  :after elfeed
  :custom
  (rmh-elfeed-org-files `(,(concat nox/emacs-directory "elfeed.org")))
  :config (elfeed-org))

(use-package elfeed-tube
  :after elfeed
  :custom
  (elfeed-tube-auto-save-p t)
  (elfeed-tube-fields '(duration thumbnail captions chapters))
  :config
  (elfeed-tube-setup)
  :general
  (:keymaps 'elfeed-show-mode-map :states 'normal
            "F" 'elfeed-tube-mpv-follow-mode
            "M" 'elfeed-tube-mpv
            "M-RET" (lambda () (interactive) (nox/avy-jump-to-link) (browse-url-generic))
            [remap save-buffer] 'elfeed-tube-save)
  (:keymaps 'elfeed-search-mode-map :states 'normal
            "F" 'elfeed-tube-fetch
            [remap elfeed-search-fetch] 'elfeed-update
            [remap save-buffer] 'elfeed-tube-save))

(use-package elfeed-tube-mpv :after efleed-tube)

(use-package reddigg :commands reddigg-view-comments)
