config.org
** Eww
The greatest text based browser to ever exist. /In my opinion!/ Here we are just trying to make it a little better.
#+begin_src emacs-lisp

  (add-hook 'eww-mode-hook (lambda ()
                             (display-line-numbers-mode -1)
                             (visual-fill-column-mode)))

#+end_src

** Mu4e
=Mu4e= is an email client for Emacs that integrates with the Mu email search engine. It allows users to manage and read email directly within Emacs, providing features like search capabilities, threading, and support for multiple mail folders. Mu4e is designed for efficiency and works well with large volumes of email, leveraging Mu's fast indexing. Users can compose, reply, and organize their emails while enjoying the extensibility and customizability of Emacs.
#+begin_src emacs-lisp

  (use-package mu4e
    :ensure nil
    :defer 5
    :hook
    (mu4e-main-mode . visual-fill-column-mode)
    (mu4e-view-mode . visual-fill-column-mode)
    :config
    (mu4e t)
    (setq user-mail-address "adwait@adhk.dev")
    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 5 minutes
    (setq mu4e-update-interval (* 5 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail/proton")

    (setq mu4e-drafts-folder "/Drafts")
    (setq mu4e-sent-folder   "/Sent")
    (setq mu4e-refile-folder "/Archive")
    (setq mu4e-trash-folder  "/Trash")

    ;; prefer text/plain when viewing mail
    (with-eval-after-load "mm-decode"
      (add-to-list 'mm-discouraged-alternatives "text/html")
      (add-to-list 'mm-discouraged-alternatives "text/richtext" t))

    (setq mu4e-maildir-shortcuts
          '((:maildir "/Archive"                :key ?a)
            (:maildir "/Drafts"                 :key ?d)
            (:maildir "/Inbox"                  :key ?i)
            (:maildir "/Sent"                   :key ?s)
            (:maildir "/Folders/Wisdom Letters" :key ?w))))

#+end_src

** PDF Tools
Viewing pdfs inside emacs. The render is created on-demand and stored in memory. Installed through nixos. Here we set ~pdf-view-themed-minor-mode~ to make it more seamless with rest of emacs. We also hide the cursor in evil normal mode inside ~pdf-view-mode~.
#+begin_src emacs-lisp

  (use-package pdf-tools
    :ensure nil
    :hook
    (pdf-view-mode . (lambda ()
                       (pdf-view-themed-minor-mode)
                       (set (make-local-variable 'evil-normal-state-cursor) (list nil))))
    :mode "\\.pdf\\'"
    :bind (:map pdf-view-mode-map
                ("j" . pdf-view-next-line-or-next-page)
                ("k" . pdf-view-previous-line-or-previous-page)
                ("C-=" . pdf-view-enlarge)
                ("C--" . pdf-view-shrink))
    :config
    (package-initialize)
    (pdf-tools-install)
    (add-to-list 'revert-without-query ".pdf"))

  (use-package org-pdftools
     :ensure nil
     :hook (org-mode . org-pdftools-setup-link))

#+end_src

** Uniline
#+begin_src emacs-lisp

  (use-package uniline :commands uniline-mode)

#+end_src


* Buffer Management
Buffers are an integral part of any emacs workflow. Here we customize it to make it more pleasing to work with.
** Ibuffer
Add icons to ibuffer as well as remove line numbers in ibuffer. Also disable ~visual-line-mode~ since we don't want text wrapping inside ibuffer.
#+begin_src emacs-lisp

  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

  (use-package ibuffer
    :ensure nil
    :commands ibuffer
    :hook
    (ibuffer-mode . (lambda () (display-line-numbers-mode -1)))
    (ibuffer-mode . (lambda () (visual-line-mode -1))))

#+end_src

** Perspective
[[https://github.com/nex3/perspective-el][Perspective]] provides multiple named workspaces inside emacs. Its similar to how window managers do this. I have improved on this to make easier keybinds for switching my most used perspectives.
#+begin_src emacs-lisp

  (use-package perspective
    :commands (nox/restore-perspectives persp-state-load)
    :custom
    (persp-state-default-file "~/.local/share/persp-state")
    (persp-mode-prefix-key (kbd "C-c b"))
    (persp-modestring-short t)
    (persp-initial-frame-name "1 aurora")
    (persp-modestring-dividers '("" "" ""))
    :config
    (add-hook 'kill-emacs-hook #'persp-state-save))

#+end_src

I have also created a handy function which helps restore the saved perspectives in my workflow. This is a kind of hacky way of restoring perspectives as it doesn't handle if you use multiple emacs frames in your workflow.
#+begin_src emacs-lisp

  (defun nox/restore-perspectives ()
    "Restores the last saved perspective-state and deletes all other frames"
    (interactive)
    (persp-state-load persp-state-default-file)
    (delete-other-frames))

#+end_src

Easier switching of perspectives using simple bindings with follow vim motions keys.
#+begin_src emacs-lisp

  (with-eval-after-load 'evil
    (evil-define-key '(normal insert) 'global
      (kbd "C-S-h") '(lambda () (interactive) (persp-switch-by-number 1))
      (kbd "C-S-j") '(lambda () (interactive) (persp-switch-by-number 2))
      (kbd "C-S-k") '(lambda () (interactive) (persp-switch-by-number 3))
      (kbd "C-S-l") '(lambda () (interactive) (persp-switch-by-number 4))))

#+end_src

* Development
** Completions
Using [[https://github.com/minad/corfu][corfu]] for completions. Corfu enhances in-buffer completion with a small completion popup. It is the minimalistic inbuffer completion counterpart of the [[#vertico][vertico]] minibuffer UI.
#+begin_src emacs-lisp

  (use-package corfu
    :hook (on-first-input . global-corfu-mode)
    :custom
    (corfu-cycle t)                 ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                  ;; Enable auto completion
    (corfu-auto-prefix 2)           ;; Enable auto completion
    (corfu-auto-delay 0.24)         ;; Enable auto completion
    (corfu-preview-current 'insert) ;; Disable current candidate preview
    (corfu-on-exact-match nil)      ;; Configure handling of exact matches
    (corfu-scroll-margin 5)         ;; Use scroll margin
    (corfu-quit-at-boundary 'separator)
    :bind
    (:map corfu-map
          ("M-SPC" . corfu-insert-separator))
    :config
    (add-to-list 'corfu--frame-parameters '(alpha-background . 0.9))

    (add-to-list
     'completion-category-overrides `(lsp-capf (styles ,@completion-styles)))

    (add-hook 'evil-insert-state-exit-hook #'corfu-quit)
    (global-corfu-mode))

#+end_src

Here we are adding icons to corfu.
#+begin_src emacs-lisp

  (use-package nerd-icons-corfu
    :after corfu
    :defer 5
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

#+end_src

Here we are enabling ~corfu-history~. This allows sorting of completions by the frequency of their use.
#+begin_src emacs-lisp

  (use-package corfu-history
    :after (corfu savehist)
    :ensure nil
    :hook
    (corfu-mode . corfu-history-mode)
    :config
    (add-to-list 'savehist-additional-variables 'corfu-history))

#+end_src

Here we setup popupinfo for the completion candidate.
#+begin_src emacs-lisp

  (use-package corfu-popupinfo
    :ensure nil
    :hook
    (corfu-mode . corfu-popupinfo-mode)
    :config
    ;; popup info delay
    (setq corfu-popupinfo-delay '(0.5 . 1.0)))

#+end_src

Changing emacs settings so that we remove commands that do not apply to the current mode. We also disable the ispell completion function.
#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :custom
    ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
    ;; try `cape-dict'.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p))

#+end_src

** Formatters
Here we use [[https://github.com/radian-software/apheleia][apheleia]] for code formatting. Formats code asynchronously and only after ~after-save-hook~.
#+begin_src emacs-lisp

  (use-package apheleia
    :hook
    (prog-mode . apheleia-mode)
    :config
    (push '(nix-ts-mode . nixfmt) apheleia-mode-alist))

#+end_src

** Flymake
Flymake is an on-the-fly syntax checking extension that provides real-time feedback about errors and warnings in your code as you write. This can greatly enhance your coding experience by catching issues early. The configuration below activates Flymake mode in programming buffers.
#+begin_src emacs-lisp

  (use-package flymake
    :ensure nil
    :hook (prog-mode . flymake-mode)
    :custom
    (flymake-margin-indicators-string
     '((error "!»" compilation-error) (warning "»" compilation-warning)
  	 (note "»" compilation-info))))

#+end_src

