init.el

(use-package lsp-mode
  :commands lsp
  :hook
  (bash-ts-mode . lsp-deferred)                  ;; Enable LSP for Bash
  (go-ts-mode . lsp-deferred)                    ;; Enable LSP for Go
  (lsp-mode . lsp-enable-which-key-integration)  ;; Integrate with Which Key
  :custom
  (lsp-keymap-prefix "C-c l")                    ;; Set the prefix for LSP commands
  (lsp-inlay-hint-enable t)                      ;; Enable inlay hints
  (lsp-completion-provider :none)                ;; Disable default completion provider
  (lsp-log-io nil)                               ;; Disable IO logging for speed
  (lsp-idle-delay 0)                             ;; Set the delay for LSP to 0
  (lsp-keep-workspace-alive nil)                 ;; Disable keeping workspace alive
  (lsp-session-file (locate-user-emacs-file ".lsp-session")) ;; Session file location

  ;; Core settings
  (lsp-enable-xref t)                            ;; Enable cross-references.
  (lsp-auto-configure t)                         ;; Automatically configure LSP.
  (lsp-enable-links nil)                         ;; Disable links.
  (lsp-eldoc-enable-hover t)                     ;; Enable ElDoc hover.
  (lsp-enable-file-watchers nil)                 ;; Disable file watchers.
  (lsp-enable-folding nil)                       ;; Disable folding.
  (lsp-enable-imenu t)                           ;; Enable Imenu support.
  (lsp-enable-indentation nil)                   ;; Disable indentation.
  (lsp-enable-on-type-formatting nil)            ;; Disable on-type formatting.
  (lsp-enable-suggest-server-download t)         ;; Enable server download suggestion.
  (lsp-enable-symbol-highlighting t)             ;; Enable symbol highlighting.
  (lsp-enable-text-document-color nil)           ;; Disable text document color.

  ;; Modeline settings
  (lsp-modeline-code-actions-enable nil)         ;; Keep modeline clean.
  (lsp-modeline-diagnostics-enable nil)          ;; Use `flymake' instead.
  (lsp-modeline-workspace-status-enable t)       ;; Display "LSP" in the modeline
  (lsp-signature-doc-lines 1)                    ;; Limit echo area to one line.
  (lsp-eldoc-render-all nil)                     ;; Render only signature messages.

  ;; Completion settings
  (lsp-completion-enable t)                      ;; Enable completion.
  (lsp-completion-enable-additional-text-edit t) ;; Enable additional text edits.
  (lsp-enable-snippet nil)                       ;; Disable snippets
  (lsp-completion-show-kind t)                   ;; Show kind in completions.
  (lsp-completion-show-detail nil)               ;; Disable long signature details

  ;; Lens settings
  (lsp-lens-enable t)                            ;; Enable lens support.

  ;; Headerline settings
  (lsp-headerline-breadcrumb-icons-enable t)            ;; Enable icons
  (lsp-headerline-breadcrumb-enable-diagnostics nil)    ;; Disable diagnostics
  (lsp-headerline-breadcrumb-enable-symbol-numbers nil) ;; Disable numbers

  ;; Disable semantic tokens.
  (lsp-semantic-tokens-enable nil)

  ;; nix
  (lsp-nix-nixd-nixpkgs-expr "import <nixpkgs> { }")
  (lsp-nix-nixd-nixos-options-expr
   "(builtins.getFlake \"/home/nox/aurora/flakes\").nixosConfigurations.anomaly.options")
  (lsp-nix-nixd-home-manager-options-expr
   "(builtins.getFlake \"/home/nox/aurora/flakes\").homeConfigurations.nox.options")
  )

(with-eval-after-load 'lsp-mode
  ;; need lsp-treemacs to make icons in breadcrumb to work
  (use-package lsp-treemacs :after lsp-mode)
  ;; lsp theming
  (set-face-attribute 'lsp-face-highlight-textual nil
                      :underline t
                      :inherit nil))

(use-package lsp-ui
  :hook
  (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-show-with-cursor nil)
  (lsp-ui-doc-show-with-mouse t)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-border "#585b70")
  (lsp-ui-doc-enable t))

(use-package nix-mode :mode "\\.nix\\'")
(use-package nushell-mode :mode "\\.nu\\'")

(use-package nix-ts-mode :hook (nix-ts-mode . lsp-deferred))
(use-package nushell-ts-mode :hook (nushell-ts-mode . lsp-deferred))

(use-package ligature
  :hook (on-first-input . global-ligature-mode)
  :config
  ;; Enable the "www" ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures '(prog-mode org-mode)
                          '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                            ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                            "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                            "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                            "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                            "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "=>" "!=" "!!" ">:"
                            ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                            "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                            "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                            "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                            "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                            "\\\\" "://")))

(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode)
  :config
  (setq rainbow-delimiters-max-face-count 5))

(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :config
  (projectile-mode 1))

;; (use-package sops
;;   :mode "\\.sops.yaml\\'"
;;   :hook
;;   (sops-mode . yaml-ts-mode)
;;   :bind (("C-c C-c" . sops-save-file)
;;          ("C-c C-k" . sops-cancel)
;;          ("C-c C-d" . sops-edit-file))
;;   :config
;;   (global-sops-mode))

(use-package treesit-auto
  :hook
  (on-first-file . global-treesit-auto-mode)
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all))

(use-package dired
  :after evil
  :ensure nil
  :commands (dired dired-jump)
  :hook
