init.el
  (dired-mode . hl-line-mode)
  ;; To hide dot-files by default
  (dired-mode . dired-omit-mode)
  ;; removing line numbers
  (dired-mode . (lambda () (display-line-numbers-mode -1)))
  (image-mode . (lambda () (display-line-numbers-mode -1)))
  :custom
  ;; hide files/directories starting with "." in dired-omit-mode
  (dired-omit-files (rx (seq bol ".")))
  ;; Display files in a human-readable format and group directories first
  ;; Also remove owner and group information
  (dired-listing-switches "-agho --group-directories-first")

  ;; Enable "do what I mean" for target directories
  (dired-dwim-target t)

  ;; Close the previous buffer when opening a new `dired' instance
  (dired-kill-when-opening-new-dired-buffer t)
  :config
  (setq dired-free-space nil
        dired-deletion-confirmer 'y-or-n-p
        dired-filter-verbose nil
        dired-clean-confirm-killing-deleted-buffers nil
        dired-recursive-deletes 'top
        dired-recursive-copies  'always
        dired-create-destination-dirs 'ask)
  (evil-define-key 'normal dired-mode-map
    (kbd "h") 'dired-up-directory
    (kbd "l") 'dired-open-file))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  :commands (dired dired-jump))

(use-package diredfl
  :hook (dired-mode . diredfl-mode)
  :commands (dired dired-jump))

(use-package dired-open
  :commands (dired dired-jump)
  :config
  (setq dired-open-extensions '(("gif" . "imv")
                                ("jpg" . "imv")
                                ("webp" . "imv")
                                ("png" . "imv")
                                ("mkv" . "mpv")
                                ("mp4" . "mpv"))))

(use-package dired-rainbow
  :commands (dired dired-jump)
  :config
  (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
  (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*")
  (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
  (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
  (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
  (dired-rainbow-define markdown "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
  (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
  (dired-rainbow-define media "#de751f" ("mp3" "mp4" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
  (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
  (dired-rainbow-define log "#c17d11" ("log"))
  (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
  (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
  (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
  (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
  (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
  (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
  (dired-rainbow-define encrypted "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
  (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
  (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
  (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules")))

(use-package peep-dired
  :commands (dired dired-jump)
  :config
  (evil-define-key 'normal peep-dired-mode-map
    (kbd "j") 'peep-dired-next-file
    (kbd "k") 'peep-dired-prev-file))

(set-face-attribute 'variable-pitch nil
                    :family "Inter"
                    :height 140
                    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
                    :family "CaskaydiaCove Nerd Font"
                    :height 140
                    :weight 'medium)
(set-face-attribute 'default nil :inherit 'fixed-pitch)
(set-face-attribute 'fixed-pitch-serif nil :inherit 'fixed-pitch :family 'unspecified)

;; setting the emoji font family
;; https://emacs.stackexchange.com/a/80186
(set-fontset-font t 'emoji
                  '("Apple Color Emoji" . "iso10646-1") nil 'prepend)


;; italic comments and keywords
(set-face-attribute 'font-lock-comment-face nil
                    :italic t)

;; setting the line spacing
(setq-default line-spacing 0.16)

(add-to-list 'default-frame-alist '(font . "CaskaydiaCove Nerd Font-14"))

(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

(use-package diff-hl
  :hook (vc-dir-mode . diff-hl-mode)
  :hook (lsp-mode . diff-hl-mode)
  :commands
  (diff-hl-stage-current-hunk
   diff-hl-revert-hunk
   diff-hl-next-hunk
   diff-hl-previous-hunk)
  :custom
  ;; Set the side for diff indicators.
  (diff-hl-side 'left)
  ;; Customize symbols for each change type.
  (diff-hl-margin-symbols-alist '((insert . "│")
                                  (delete . "-")
                                  (change . "│")
                                  (unknown . "?")
                                  (ignored . "i")))
  (diff-hl-show-staged-changes nil)
  :config
  ;; implements highlighting changes on the fly.
  (diff-hl-flydiff-mode 1)
  ;; changes the highlighting function to use the margin instead of the fringe.
  (diff-hl-margin-mode 1))

(use-package transient)
(use-package magit
  :commands magit-status
  :hook
  (magit-pre-refresh . diff-hl-magit-pre-refresh)
  (magit-post-refresh . diff-hl-magit-post-refresh))
