config.org
** Better Fonts
#+begin_src emacs-lisp

  (defun nox/org-font-setup ()
    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block-begin-line nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-block-end-line nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-document-info-keyword nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-special-keyword nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-code nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-cite nil
                        :underline nil)

    (set-face-attribute 'org-verbatim nil
                        :inherit 'variable-pitch)

    (set-face-attribute 'line-number-current-line nil
                        :inherit 'fixed-pitch)
    (set-face-attribute 'org-block nil
                        :inherit 'fixed-pitch)

    (set-face-attribute 'font-lock-string-face nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table    nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula  nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number  nil :inherit 'fixed-pitch)

    ;; disable large title
    (set-face-attribute 'org-document-title nil :height 'unspecified))

#+end_src

** Org Roam
#+begin_src emacs-lisp

  (use-package org-roam
    :commands
    (org-roam-capture
     org-roam-dailies-capture-today
     org-roam-node-find
     nox/org-roam-capture-tasks
     org-roam-goto-today)
    :custom
    (org-roam-directory nox/notes-directory)
    (org-roam-dailies-directory "Logs/")
    (org-roam-completion-everywhere t)

#+end_src

Here we are setting up capture templates for org-roam-capture.
#+begin_src emacs-lisp

  ;; see help for format-time-string function for time templates
  (org-roam-capture-templates
   '(("d" "default" item "%?%i"
      :if-new (file+head+olp
               "%<%Y%m%d%H%M%S>-${slug}.org"
               "#+title: ${title}\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: note"
               ("${title}"))
      :unnarrowed t
      :kill-buffer t)
     ("l" "linked" item "%?\n%a"
      :if-new (file+head+olp
               "%<%Y%m%d%H%M%S>-${slug}.org"
               "#+title: ${title}\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: note"
               ("${title}"))
      :unnarrowed t
      :kill-buffer t)))

#+end_src

Here we are setting up capture  templates for org-roam-dailies.
#+begin_src emacs-lisp

  (org-roam-dailies-capture-templates
   '(("d" "default" item "*%<%H:%M>* %?"
      :if-new (file+head+olp
               "%<%Y-%m-%d>.org"
               "#+title: %<%Y-%m-%d>\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: daily"
               ("%<%B %d, %Y>"))
      :unnarrowed t
      :kill-buffer t)
   ("l" "linked" item "*%<%H:%M>* %?\n%a"
    :if-new (file+head+olp
             "%<%Y-%m-%d>.org"
             "#+title: %<%Y-%m-%d>\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: daily"
             ("%<%B %d, %Y>"))
    :unnarrowed t
    :kill-buffer t)))

#+end_src

Now anything else that we want to be loaded when org-roam loads go here.
#+begin_src emacs-lisp

  :config
  (org-roam-db-autosync-mode)
  ;; auto insert mode
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

#+end_src

These following are the custom capture lists that I have made for org roam.
#+begin_src emacs-lisp

  (defun nox/org-roam-capture-tasks ()
    "Custom capture list for org roam"
    (interactive)
    (org-roam-capture-
     :node (org-roam-node-create)
     :templates '(
                  ("t" "General Task"
                   entry "*** TODO %?"
                   :kill-buffer t
                   :if-new (file+head+olp
                            "Inbox/tasks.org"
                            "#+title: Tasks\n#+category: tasks"
                            ("Tasks" "General Tasks")))
                  ("l" "Linked Task"
                   entry "*** TODO %?\n%a"
                   :kill-buffer t
                   :if-new (file+head+olp
                            "Inbox/tasks.org"
                            "#+title: Tasks\n#+category: tasks"
                            ("Tasks" "Linked Tasks")))
                  ))))

#+end_src


The properties drawer that org roam uses is intended to only be used by org roam. So here we are hiding the property drawer but also adding some helpful commands to show it when we want. This code snippet comes from [[https://github.com/org-roam/org-roam/wiki/User-contributed-Tricks#hiding-the-properties-drawer][org roam wiki]].
#+begin_src emacs-lisp

  (defun nox/org-hide-properties ()
    "Hide all org-mode headline property drawers in buffer. Could be slow if it has a lot of overlays."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward
              "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
        (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
          (overlay-put ov_this 'display "")
          (overlay-put ov_this 'hidden-prop-drawer t))))
    (put 'org-toggle-properties-hide-state 'state 'hidden))

  (defun nox/org-show-properties ()
    "Show all org-mode property drawers hidden by org-hide-properties."
    (interactive)
    (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
    (put 'org-toggle-properties-hide-state 'state 'shown))

  (defun nox/org-toggle-properties ()
    "Toggle visibility of property drawers."
    (interactive)
    (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
        (nox/org-show-properties)
      (nox/org-hide-properties)))

  ;; call org-hide-properties when inside org mode and org capture
  (add-hook 'org-mode-hook 'nox/org-hide-properties)
  (add-hook 'org-capture-mode-hook 'nox/org-hide-properties)

#+end_src

Similarly, we add a new field to listing of org roam nodes. Now ~org-roam-node-find~ also shows the number of backlinks as well as modification time for a given node. Source is a combination of [[https://github.com/org-roam/org-roam/wiki/User-contributed-Tricks#modification-time-annotation-in-org-roam-node-find-minad][minad/marginalia modification time]] and [[https://github.com/org-roam/org-roam/wiki/User-contributed-Tricks#showing-the-number-of-backlinks-for-each-node-in-org-roam-node-find][backlinks count]].
#+begin_src emacs-lisp

  (with-eval-after-load 'org-roam

    (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
      (let* ((count (caar (org-roam-db-query
                           [:select (funcall count source)
                                    :from links
                                    :where (= dest $s1)
                                    :and (= type "id")]
                           (org-roam-node-id node)))))
        (format "[%d]" count)))

    (setq org-roam-node-display-template
          (concat "${title:80}" (propertize "${tags:20}" 'face 'org-tag))
          org-roam-node-annotation-function
          (lambda (node)
            (concat (org-roam-node-backlinkscount node) " "
                    (marginalia--time (org-roam-node-file-mtime node)))))
    )

#+end_src

** Prettify Symbols
#+begin_src emacs-lisp

  (setq-default prettify-symbols-alist
                '(("#+begin_src emacs-lisp" . "")
                  ("#+begin_src nix" . "")
                  (":ATTACH:" . "🔗")
                  ("#+begin_src" . "»")
                  ("#+end_src" . "«")
                  ("#+begin_quote" . "")
                  ("#+end_quote" . "")
                  ("#+RESULTS:" . "󰥤")
                  (":tangle" . "󰯊")
                  (":mkdirp yes" . "")
                  ("lambda" . "λ")
                  ("(interactive)" . "")))

  (setq prettify-symbols-unprettify-at-point 'right-edge)

#+end_src

