init.el

(defun nox/org-font-setup ()
  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block-begin-line nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-block-end-line nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-document-info-keyword nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-special-keyword nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-code nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-cite nil
                      :underline nil)

  (set-face-attribute 'org-verbatim nil
                      :inherit 'variable-pitch)

  (set-face-attribute 'line-number-current-line nil
                      :inherit 'fixed-pitch)
  (set-face-attribute 'org-block nil
                      :inherit 'fixed-pitch)

  (set-face-attribute 'font-lock-string-face nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table    nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula  nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number  nil :inherit 'fixed-pitch)

  ;; disable large title
  (set-face-attribute 'org-document-title nil :height 'unspecified))

(use-package org-roam
  :commands
  (org-roam-capture
   org-roam-dailies-capture-today
   org-roam-node-find
   nox/org-roam-capture-tasks
   org-roam-goto-today)
  :custom
  (org-roam-directory nox/notes-directory)
  (org-roam-dailies-directory "Logs/")
  (org-roam-completion-everywhere t)

;; see help for format-time-string function for time templates
(org-roam-capture-templates
 '(("d" "default" item "%?%i"
    :if-new (file+head+olp
             "%<%Y%m%d%H%M%S>-${slug}.org"
             "#+title: ${title}\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: note"
             ("${title}"))
    :unnarrowed t
    :kill-buffer t)
   ("l" "linked" item "%?\n%a"
    :if-new (file+head+olp
             "%<%Y%m%d%H%M%S>-${slug}.org"
             "#+title: ${title}\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: note"
             ("${title}"))
    :unnarrowed t
    :kill-buffer t)))

(org-roam-dailies-capture-templates
 '(("d" "default" item "*%<%H:%M>* %?"
    :if-new (file+head+olp
             "%<%Y-%m-%d>.org"
             "#+title: %<%Y-%m-%d>\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: daily"
             ("%<%B %d, %Y>"))
    :unnarrowed t
    :kill-buffer t)
 ("l" "linked" item "*%<%H:%M>* %?\n%a"
  :if-new (file+head+olp
           "%<%Y-%m-%d>.org"
           "#+title: %<%Y-%m-%d>\n#+date: [%<%Y-%m-%d %a %H:%M>]\n#+category: daily"
           ("%<%B %d, %Y>"))
  :unnarrowed t
  :kill-buffer t)))

:config
(org-roam-db-autosync-mode)
;; auto insert mode
(add-hook 'org-capture-mode-hook 'evil-insert-state)

(defun nox/org-roam-capture-tasks ()
  "Custom capture list for org roam"
  (interactive)
  (org-roam-capture-
   :node (org-roam-node-create)
   :templates '(
                ("t" "General Task"
                 entry "*** TODO %?"
                 :kill-buffer t
                 :if-new (file+head+olp
                          "Inbox/tasks.org"
                          "#+title: Tasks\n#+category: tasks"
                          ("Tasks" "General Tasks")))
                ("l" "Linked Task"
                 entry "*** TODO %?\n%a"
                 :kill-buffer t
                 :if-new (file+head+olp
                          "Inbox/tasks.org"
                          "#+title: Tasks\n#+category: tasks"
                          ("Tasks" "Linked Tasks")))
                ))))

(defun nox/org-hide-properties ()
  "Hide all org-mode headline property drawers in buffer. Could be slow if it has a lot of overlays."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward
            "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
      (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
        (overlay-put ov_this 'display "")
        (overlay-put ov_this 'hidden-prop-drawer t))))
  (put 'org-toggle-properties-hide-state 'state 'hidden))

(defun nox/org-show-properties ()
  "Show all org-mode property drawers hidden by org-hide-properties."
  (interactive)
  (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
  (put 'org-toggle-properties-hide-state 'state 'shown))

(defun nox/org-toggle-properties ()
  "Toggle visibility of property drawers."
  (interactive)
  (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
      (nox/org-show-properties)
    (nox/org-hide-properties)))

;; call org-hide-properties when inside org mode and org capture
(add-hook 'org-mode-hook 'nox/org-hide-properties)
(add-hook 'org-capture-mode-hook 'nox/org-hide-properties)

(with-eval-after-load 'org-roam

  (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
    (let* ((count (caar (org-roam-db-query
                         [:select (funcall count source)
                                  :from links
                                  :where (= dest $s1)
                                  :and (= type "id")]
                         (org-roam-node-id node)))))
      (format "[%d]" count)))

  (setq org-roam-node-display-template
        (concat "${title:80}" (propertize "${tags:20}" 'face 'org-tag))
        org-roam-node-annotation-function
        (lambda (node)
          (concat (org-roam-node-backlinkscount node) " "
                  (marginalia--time (org-roam-node-file-mtime node)))))
  )

(setq-default prettify-symbols-alist
              '(("#+begin_src emacs-lisp" . "")
                ("#+begin_src nix" . "")
                (":ATTACH:" . "🔗")
                ("#+begin_src" . "»")
                ("#+end_src" . "«")
                ("#+begin_quote" . "")
                ("#+end_quote" . "")
                ("#+RESULTS:" . "󰥤")
                (":tangle" . "󰯊")
                (":mkdirp yes" . "")
                ("lambda" . "λ")
                ("(interactive)" . "")))

(setq prettify-symbols-unprettify-at-point 'right-edge)
