config.org
** Settings
Making org mode more akin to my linking.
#+begin_src emacs-lisp

  ;; Using RETURN to follow links in Org/Evil
  ;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))

  ;; Setting RETURN key in org-mode to follow links
  (setq org-return-follows-link  t)

  (use-package org
    :ensure nil
    :defer t
    :hook
    (org-mode . org-indent-mode)
    (org-mode . prettify-symbols-mode)
    (org-mode . (lambda () (display-line-numbers-mode -1)))
    (org-mode . visual-line-mode)
    (org-mode . variable-pitch-mode)
    :custom
    (org-attach-id-dir "attachments/")
    (org-attach-use-inheritance t)
    (org-attach-method 'mv)
    (org-startup-with-inline-images t)
    (org-image-align 'center)
    (org-fontify-quote-and-verse-blocks t)
    (org-support-shift-select t)
    (org-hide-emphasis-markers t)
    :config
    (require 'docx-to-org)
    (nox/org-font-setup))

#+end_src

** Small Utilities
Add a table of content to org mode files. For this you just need to add a level one heading with :toc: tag.
#+begin_src emacs-lisp

  (use-package toc-org
      :hook (org-mode . toc-org-enable))

#+end_src

Make editing of links and any other hidden emphasis markers easy.
#+begin_src emacs-lisp

  (use-package org-appear
    :hook (org-mode . org-appear-mode)
    :custom (org-appear-autolinks t))

#+end_src

Enable auto tangling of org files. For this to work you need to set a new option to the file namely ~#+autotangle: t~.
#+begin_src emacs-lisp

  (use-package org-auto-tangle
    :hook (org-mode . org-auto-tangle-mode))

#+end_src

For better, faster and easier src blocks and other kinds of blocks.
#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("nix" . "src nix"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))

    ;; turn off < auto pairing inside org-mode
    (add-hook 'org-mode-hook (lambda ()
                               (setq-local electric-pair-inhibit-predicate
                                           `(lambda (c)
                                              (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))))

#+end_src

