config.org
** SVG Tags
#+begin_src emacs-lisp

  (use-package svg-tag-mode
    :after org
    :hook
    (org-mode . svg-tag-mode)
    :custom
    (svg-tag-action-at-point 'edit)
    :config
    (set-face-attribute 'svg-tag-default-face nil :inherit 'fixed-pitch)
    (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
    (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
    (defconst day-re "[A-Za-z]\\{3\\}")
    (defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))
    (setq svg-tag-tags
          `(
            ;; Task priority
            ("\\[#A\\]" .
             ((lambda (tag) (svg-tag-make "#A"  :face
                                          ;;`(:foreground ,(catppuccin-get-color 'red))
                                          :beg 2 :end -1 :margin 0))))
            ("\\[#B\\]" .
             ((lambda (tag) (svg-tag-make "#B"  :face
                                          ;;`(:foreground ,(catppuccin-get-color 'yellow))
                                          :beg 2 :end -1 :margin 0))))
            ("\\[#C\\]" .
             ((lambda (tag) (svg-tag-make "#C"  :face
                                          ;;`(:foreground ,(catppuccin-get-color 'green))
                                          :beg 2 :end -1 :margin 0))))

            ;; Citation of the form [cite:@Knuth:1984]
            ("\\(\\[cite:@[A-Za-z]+:\\)" .
             ((lambda (tag) (svg-tag-make tag  :inverse t
                                          :beg 7 :end -1
                                          :crop-right t))))
            ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" .
             ((lambda (tag) (svg-tag-make tag  :end -1
                                          :crop-left t))))

            ;; Active date (with or without day name, with or without time)
            (,(format "\\(<%s>\\)" date-re) .
             ((lambda (tag) (svg-tag-make tag  :beg 1
                                          :end -1
                                          :margin 0))))
            (,(format "\\(<%s \\)%s>" date-re day-time-re) .
             ((lambda (tag) (svg-tag-make tag  :beg 1
                                          :inverse nil
                                          :crop-right t
                                          :margin 0))))
            (,(format "<%s \\(%s>\\)" date-re day-time-re) .
             ((lambda (tag) (svg-tag-make tag  :end -1
                                          :inverse t
                                          :crop-left t
                                          :margin 0))))

            ;; Inactive date  (with or without day name, with or without time)
            (,(format "\\(\\[%s\\]\\)" date-re) .
             ((lambda (tag) (svg-tag-make tag  :beg 1
                                          :end -1
                                          :margin 0
                                          :face 'org-date))))
            (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
             ((lambda (tag) (svg-tag-make tag  :beg 1
                                          :inverse nil
                                          :crop-right t
                                          :margin 0
                                          :face 'org-date))))
            (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
             ((lambda (tag) (svg-tag-make tag  :end -1
                                          :inverse t
                                          :crop-left t
                                          :margin 0
                                          :face 'org-date))))

            ;; Todos
            ("TODO" .
             ((lambda (tag) (svg-tag-make "TODO"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'peach))
                                          :inverse t
                                          :margin 0))))
            ("READ" .
             ((lambda (tag) (svg-tag-make "READ"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'rosewater))
                                          :inverse t
                                          :margin 0))))
            ("PLAN" .
             ((lambda (tag) (svg-tag-make "PLAN"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'maroon))
                                          :inverse t
                                          :margin 0))))
            ("PROG" .
             ((lambda (tag) (svg-tag-make "PROG"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'teal))
                                          :inverse t
                                          :margin 0))))
            ("WAIT" .
             ((lambda (tag) (svg-tag-make "WAIT"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'red))
                                          :inverse t
                                          :margin 0))))
            ("DONE" .
             ((lambda (tag) (svg-tag-make "DONE"
                                          :face
                                          ;;`(:foreground ,(catppuccin-get-color 'green))
                                          :inverse t
                                          :margin 0))))
            ("CANC" .
             ((lambda (tag) (svg-tag-make "CANC"
                                          :face
                                          ;;`(:foreground
                                          ;;  ,(catppuccin-get-color 'overlay0))
                                          :inverse t
                                          :margin 0)))))))

#+end_src

** Visual Fill Column
Centering org documents for easier editing experience.
#+begin_src emacs-lisp

  (use-package visual-fill-column
    :hook
    (org-mode . visual-fill-column-mode)
    (org-agenda-mode . visual-fill-column-mode)
    :custom
    (visual-fill-column-width 100)
    (visual-fill-column-center-text t))

#+end_src


* Shells & Terminals
** Eshell
#+begin_src emacs-lisp

  (setq eshell-rc-script (concat nox/emacs-directory "eshell/profile")
        eshell-aliases-file (concat nox/emacs-directory "eshell/aliases")
        eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

  (add-hook 'eshell-mode-hook (lambda ()
                                (hide-mode-line-mode)))

  (use-package eshell-toggle
    :commands eshell-toggle
    :custom
    (eshell-toggle-run-command nil)
    (eshell-toggle-size-fraction 2))

#+end_src

#+begin_src eshell-alias :tangle eshell/aliases :mkdirp yes

  alias cls clear 1
  alias e 'find-file $1'

#+end_src

** Vterm
#+begin_src emacs-lisp

  (use-package vterm
    :commands (vterm vterm-toggle)
    :hook
    (vterm-mode . (lambda () (display-line-numbers-mode -1)))
    (vterm-mode . hide-mode-line-mode)
    :custom
    (vterm-shell "zsh -c nu"))

  (use-package vterm-toggle :commands vterm-toggle)

#+end_src

* Undo
** Undo Fu
[[https://github.com/emacsmirror/undo-fu][Undo Fu]] is a light weight wrapper for Emacs built-in undo system, adding convenient undo/redo without losing access to the full undo history, allowing you to visit all previous states of the document if you need. Here we also increase the default undo limit from =0.15mb= to the following mentioned values.
#+begin_src emacs-lisp

  (use-package undo-fu
    :after evil
    :config
    (setq undo-limit 67108864)          ; 64mb.
    (setq undo-strong-limit 100663296)  ; 96mb.
    (setq undo-outer-limit 1006632960)) ; 960mb.

#+end_src

We also use [[https://codeberg.org/ideasman42/emacs-undo-fu-session][undo fu session]] to persist the undo/redo history through emacs sessions. This means the undo history won't be lost when restarting emacs.
#+begin_src emacs-lisp

  (use-package undo-fu-session
    :after undo-fu
    :config
    (undo-fu-session-global-mode)
    (setq undo-fu-session-incompatible-files
          '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))

#+end_src

